In [1]:
#Aim:performing the operation fro creation of an data frame

In [2]:
#name:Mohammad Mudakkir
#Roll no:41
#section:3A

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrame([[10,15,14,18],[13,14,15,16],[18,19,20,11]],
         columns=["CD","DBMS","DSS","CAO"])

In [5]:
df

   CD  DBMS  DSS  CAO
0  10    15   14   18
1  13    14   15   16
2  18    19   20   11

In [6]:
df.shape

(3, 4)

In [7]:
df.size

12

In [8]:
df2=pd.DataFrame([[5,6,7,8]],
                columns=["CD","DBMS","DSS","CAO"])

In [9]:
df3=df.append(df2,ignore_index=True)

In [10]:
df3

   CD  DBMS  DSS  CAO
0  10    15   14   18
1  13    14   15   16
2  18    19   20   11
3   5     6    7    8

In [11]:
df3=df.append(df2)

In [12]:
df3

   CD  DBMS  DSS  CAO
0  10    15   14   18
1  13    14   15   16
2  18    19   20   11
0   5     6    7    8

# Adding Attribute (Columns)name DM

In [14]:
df3["DM"]=[12,15,17,19]

In [15]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    15   14   18  12
1  13    14   15   16  15
2  18    19   20   11  17
0   5     6    7    8  19

# Deleting Record From DataFrame

In [16]:
df4=df3.drop(index=[1])

In [17]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    15   14   18  12
2  18    19   20   11  17
0   5     6    7    8  19

In [18]:
df5=df3.drop(columns=["DM"])

In [19]:
df5

   CD  DBMS  DSS  CAO
0  10    15   14   18
1  13    14   15   16
2  18    19   20   11
0   5     6    7    8

In [20]:
#finding mean of DSS
print("Mean of DSS:",df5["DSS"].mean())

Mean of DSS: 14.0

In [21]:
#finding median of DSS
print("Median of DSS:",df5["DSS"].median())

Median of DSS: 14.5

In [22]:
#finding mode of DSS
print("Mode of DSS:",df5["DSS"].mode())

Mode of DSS: 0     7
1    14
2    15
3    20
dtype: int64

In [23]:
#finding min of DSS
print("Min of DSS:",df5["DSS"].min())

Min of DSS: 7

In [24]:
#finding max of DSS
print("Max of DSS:",df5["DSS"].max())

Max of DSS: 20

In [26]:
Name=["Mudakkir","Rafey","Huzefa","Anas","Affan"]
Name

['Mudakkir', 'Rafey', 'Huzefa', 'Anas', 'Affan']

In [27]:
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1    Mudakkir
2       Rafey
3      Huzefa
4        Anas
5       Affan
dtype: object

In [ ]:
#Conclusion:-In this experiment, we successfully learned how to create and manipulate DataFrames using the Pandas library in Python.